CyrilNoahRapid/toolchain/xdctools/xdctools_3_20_06_81/packages/ti/mcu/msp430/include/msp430x47127.h
SFR_8BIT(P8IN);                               /* Port 8 Input */
SFR_8BIT(P8OUT);                              /* Port 8 Output */
SFR_8BIT(P8DIR);                              /* Port 8 Direction */
SFR_8BIT(P8SEL);                              /* Port 8 Selection */
SFR_8BIT(P8REN);                              /* Port 8 Resistor Enable */

SFR_16BIT(PAIN);                              /* Port A Input */
SFR_16BIT(PAOUT);                             /* Port A Output */
SFR_16BIT(PADIR);                             /* Port A Direction */
SFR_16BIT(PASEL);                             /* Port A Selection */
SFR_16BIT(PAREN);                             /* Port A Resistor Enable */

/************************************************************
* DIGITAL I/O Port9/10 Pull up / Pull down Resistors
************************************************************/
#define __MSP430_HAS_PORT9_R__                /* Definition to show that Module is available */
#define __MSP430_HAS_PORT10_R__                /* Definition to show that Module is available */
#define __MSP430_HAS_PORTB_R__                /* Definition to show that Module is available */

SFR_8BIT(P9IN);                               /* Port 9 Input */
SFR_8BIT(P9OUT);                              /* Port 9 Output */
SFR_8BIT(P9DIR);                              /* Port 9 Direction */
SFR_8BIT(P9SEL);                              /* Port 9 Selection */
SFR_8BIT(P9REN);                              /* Port 9 Resistor Enable */

SFR_8BIT(P10IN);                              /* Port 10 Input */
SFR_8BIT(P10OUT);                             /* Port 10 Output */
SFR_8BIT(P10DIR);                             /* Port 10 Direction */
SFR_8BIT(P10SEL);                             /* Port 10 Selection */
SFR_8BIT(P10REN);                             /* Port 10 Resistor Enable */

SFR_16BIT(PBIN);                              /* Port B Input */
SFR_16BIT(PBOUT);                             /* Port B Output */
SFR_16BIT(PBDIR);                             /* Port B Direction */
SFR_16BIT(PBSEL);                             /* Port B Selection */
SFR_16BIT(PBREN);                             /* Port B Resistor Enable */
              
/************************************************************
* Brown-Out, Supply Voltage Supervision (SVS)
************************************************************/
#define __MSP430_HAS_SVS__                    /* Definition to show that Module is available */

SFR_8BIT(SVSCTL);                             /* SVS Control */
#define SVSFG                  (0x01)         /* SVS Flag */
#define SVSOP                  (0x02)         /* SVS output (read only) */
#define SVSON                  (0x04)         /* Switches the SVS on/off */
#define PORON                  (0x08)         /* Enable POR Generation if Low Voltage */
#define VLD0                   (0x10)
#define VLD1                   (0x20)
#define VLD2                   (0x40)
#define VLD3                   (0x80)

#define VLDON                  (0x10)
#define VLDOFF                 (0x00)
#define VLD_1_8V               (0x10)

/************************************************************
* SD16_A7 - Sigma Delta 16 Bit
************************************************************/
#define __MSP430_HAS_SD16_A7__                /* Definition to show that Module is available */

SFR_8BIT(SD16INCTL0);                         /* SD16 Input Control Register Channel 0 */
SFR_8BIT(SD16INCTL1);                         /* SD16 Input Control Register Channel 1 */
SFR_8BIT(SD16INCTL2);                         /* SD16 Input Control Register Channel 2 */
SFR_8BIT(SD16INCTL3);                         /* SD16 Input Control Register Channel 3 */
SFR_8BIT(SD16INCTL4);                         /* SD16 Input Control Register Channel 4 */
SFR_8BIT(SD16INCTL5);                         /* SD16 Input Control Register Channel 5 */
SFR_8BIT(SD16INCTL6);                         /* SD16 Input Control Register Channel 6 */
SFR_8BIT(SD16PRE0);                           /* SD16 Preload Register Channel 0 */
SFR_8BIT(SD16PRE1);                           /* SD16 Preload Register Channel 1 */
SFR_8BIT(SD16PRE2);                           /* SD16 Preload Register Channel 2 */
SFR_8BIT(SD16PRE3);                           /* SD16 Preload Register Channel 3 */
SFR_8BIT(SD16PRE4);                           /* SD16 Preload Register Channel 4 */
SFR_8BIT(SD16PRE5);                           /* SD16 Preload Register Channel 5 */
SFR_8BIT(SD16PRE6);                           /* SD16 Preload Register Channel 6 */
//sfrb    SD16CONF0           (0x00B7)  /* SD16 Internal Configuration Register 0 */
SFR_8BIT(SD16CONF1);                          /* SD16 Internal Configuration Register 1 */
                                      /* Please use only the recommended settings */

SFR_16BIT(SD16CTL);                           /* Sigma Delta ADC 16 Control Register */
SFR_16BIT(SD16CCTL0);                         /* SD16 Channel 0 Control Register */
SFR_16BIT(SD16CCTL1);                         /* SD16 Channel 1 Control Register */
SFR_16BIT(SD16CCTL2);                         /* SD16 Channel 2 Control Register */
SFR_16BIT(SD16CCTL3);                         /* SD16 Channel 3 Control Register */
SFR_16BIT(SD16CCTL4);                         /* SD16 Channel 4 Control Register */
SFR_16BIT(SD16CCTL5);                         /* SD16 Channel 5 Control Register */
SFR_16BIT(SD16CCTL6);                         /* SD16 Channel 6 Control Register */
SFR_16BIT(SD16MEM0);                          /* SD16 Channel 0 Conversion Memory */
SFR_16BIT(SD16MEM1);                          /* SD16 Channel 1 Conversion Memory */
SFR_16BIT(SD16MEM2);                          /* SD16 Channel 2 Conversion Memory */
SFR_16BIT(SD16MEM3);                          /* SD16 Channel 3 Conversion Memory */
SFR_16BIT(SD16MEM4);                          /* SD16 Channel 4 Conversion Memory */
SFR_16BIT(SD16MEM5);                          /* SD16 Channel 5 Conversion Memory */
SFR_16BIT(SD16MEM6);                          /* SD16 Channel 6 Conversion Memory */
SFR_16BIT(SD16IV);                            /* SD16 Interrupt Vector Register */

/* SD16INCTLx */
#define SD16INCH0              (0x0001)       /* SD16 Input Channel select 0 */
#define SD16INCH1              (0x0002)       /* SD16 Input Channel select 1 */
#define SD16INCH2              (0x0004)       /* SD16 Input Channel select 2 */
#define SD16GAIN0              (0x0008)       /* SD16 Input Pre-Amplifier Gain Select 0 */
#define SD16GAIN1              (0x0010)       /* SD16 Input Pre-Amplifier Gain Select 1 */
#define SD16GAIN2              (0x0020)       /* SD16 Input Pre-Amplifier Gain Select 2 */
#define SD16INTDLY0            (0x0040)       /* SD16 Interrupt Delay after 1.Conversion 0 */
#define SD16INTDLY1            (0x0080)       /* SD16 Interrupt Delay after 1.Conversion 1 */

